FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ДляДомаИДачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ДляДомаИДачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AdStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowEmail</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Availability</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_Availability</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvitoId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Category</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Condition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ConditionДляДомаИДачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoodsSubType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_GoodsSubType_ДляДомаИДачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoodsType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_GoodsType_ДляДомаИДачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Comment>Уникальный идентификатор объявления в вашей базе данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListingFee</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nsDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VideoURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ДляДомаИДачи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПроверкуЗаполненияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Category.СписокВыбора.ЗагрузитьЗначения(ns_ДляДомаИДачиФормы.ПолучитьСписокКатегорий());
	УстановитьВидимостьРеквизитов();
КонецПроцедуры
 
//КонецОбласти

//Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура CategoryПриИзменении(Элемент)                                                                                
	СброситьРеквизитыЗаполнения(Истина);
	//Элементы.GoodsType.СписокВыбора.ЗагрузитьЗначения(ns_ДляДомаИДачиФормы.ПолучитьСписокПодкатегорий(Объект.Category));
	ОбновитьРеквизиты();
	УстановитьПроверкуЗаполненияНаСервере();
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура GoodsTypeПриИзменении(Элемент)
	СброситьРеквизитыЗаполнения();
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

//КонецОбласти

//Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьTitle(Команда)
	Объект.Title = СформироватьTitleНаСервере(Объект.ШаблонЗаголовка, Объект.Title, Объект.Номенклатура, Объект.Характеристика);
КонецПроцедуры

//КонецОбласти

//Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПроверкуЗаполненияНаСервере()
	ОбязательныеПоля = ns_ДляДомаИДачиВалидация.ПолучитьОбязательныеПоля();
	Для каждого ИмяПоля Из ОбязательныеПоля Цикл
		Элементы[ИмяПоля].АвтоОтметкаНезаполненного = Истина;
	КонецЦикла; 
	
	ДополнительныеОбязательныеПоля = ns_ДляДомаИДачиВалидация.ПолучитьДополнительныеОбязательныеПоля(Объект.Category, Объект.GoodsType);
	Для каждого ИмяПоля Из ДополнительныеОбязательныеПоля Цикл
		Элементы[ИмяПоля].АвтоОтметкаНезаполненного = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизиты()
	Для каждого Реквизит Из Метаданные.Справочники.ns_ДляДомаИДачи.Реквизиты Цикл
		Если НЕ Элементы.Найти(Реквизит.Имя) = Неопределено Тогда
			Попытка
				Если Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
					Элементы[Реквизит.Имя].АвтоОтметкаНезаполненного = Истина;
					Элементы[Реквизит.Имя].ОтметкаНезаполненного = Истина;
				Иначе
					Элементы[Реквизит.Имя].АвтоОтметкаНезаполненного = Ложь;
					Элементы[Реквизит.Имя].ОтметкаНезаполненного = Ложь;
				КонецЕсли;
				Элементы[Реквизит.Имя].Видимость = Истина;	
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьTitleНаСервере(ШаблонЗаголовка, Заголовок, Номенклатура, Характеристика)
	Возврат ns_ШаблонизаторСервер.СформироватьTitle(ШаблонЗаголовка, Заголовок, Номенклатура, Характеристика);
КонецФункции

&НаКлиенте
Процедура СброситьРеквизитыЗаполнения(ОчищатьGoodsType = Ложь)
	Если ОчищатьGoodsType Тогда
		Объект.GoodsType = Неопределено;
	КонецЕсли;
	Объект.GoodsSubType = Неопределено;
	Объект.Availability = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
	Если НЕ ЗначениеЗаполнено(Объект.Category) Тогда
		Элементы.GoodsType.Видимость = Ложь;
	Иначе
		Элементы.GoodsType.Видимость = ns_ДляДомаИДачиВалидация.УстановитьВидимость_GoodsType(Объект.Category);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.GoodsType) Тогда
		Элементы.GoodsSubType.Видимость = Ложь;
		Элементы.Availability.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.GoodsSubType.Видимость = ns_ДляДомаИДачиВалидация.УстановитьВидимость_GoodsSubType(Объект.Category, Объект.GoodsType);
	Элементы.Availability.Видимость = ns_ДляДомаИДачиВалидация.УстановитьВидимость_Availability(Объект.Category, Объект.GoodsType);
	
КонецПроцедуры

//КонецОбласти
